-- Q. 데이터결합 (실습 join0_2) 182p
-- emp, dept 테이블을 이용하여 다음과 같이 조회되도록 쿼리를 작성하세요.
-- (급여가 2500 초과)



-- Q. 데이터결합 (실습 join0_3) 183p
-- emp, dept 테이블을 이용하여 다음과 같이 조회되도록 쿼리를 작성하세요.
-- (급여가 2500 초과, 사번이 7600보다 큰 직원)



-- Q. 데이터결합 (실습 join0_4) 184p
-- emp, dept 테이블을 이용하여 다음과 같이 조회되도록 쿼리를 작성하세요.
-- (급여가 2500 초과, 사번이 7600보다 크고 부서명이 RESEARCH인 부서에 속한 직원)



-- Q. 데이터결합 (실습 join1) 185p
-- erd 다이어그램을 참고하여 prod 테이블과 lprod 테이블을 조인하여
-- 다음과 같은 결과가 나오는 쿼리를 작성해보세요.



-- 같은 컬럼명이 없어서 natural join, JOIN USING 은 쓸 수 없음.

-- Q. 데이터결합 (실습 join2) 186p
-- erd 다이어그램을 참고하여 buyer, prod 테이블을 조인하여
-- buyer별 담당하는 제품 정보를 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.



-- Q. 데이터결합 (실습 join3) 187p
-- erd 다이어그램을 참고하여 member, cart, prod 테이블을 조인하여
-- 회원별 장바구니에 담은 제품 정보를 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.



-- Q. 데이터결합 (실습 join4) 188-9p
-- erd 다이어그램을 참고하여 customer,cycle 테이블을 조인하여
-- 고객별 애음 제품, 애음 요일, 개수를 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.
-- (고객명이 brown, sally인 고객만 조회)




-- Q. 데이터결합 (실습 join5) 190p
-- erd 다이어그램을 참고하여 customer,cycle,product 테이블을 조인하여
-- 고객별 애음 제품, 애음 요일, 개수, 제품명을 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.
-- (고객명이 brown, sally인 고객만 조회)




-- Q. 데이터결합 (실습 join6) 191p
-- erd 다이어그램을 참고하여 customer,cycle,product 테이블을 조인하여 애음요일과 관계없이
-- 고객별 애음 제품별, 개수의 합과, 제품명을 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.
-- (고객명이 brown, sally인 고객만 조회)

-- 내가 푼 것


-- 쌤 풀이
-- 고객, 제품별 애음건수 (요일과 관계없이)
-- 풀이1



-- 풀이2



-- 풀이3



-- Q. 데이터결합 (실습 join7) 192p
-- erd 다이어그램을 참고하여 cycle,product 테이블을 조인하여 
-- 제품별, 개수의 합과, 제품명을 다음과 같은 결과가 나오도록 쿼리를 작성해보세요.





